#+TITLE: Emacs Configuration
#+AUTHOR: Jean-Martin Archer jm@jmartin

** Pretty symbols
#+begin_src emacs-lisp :tangle yes
(defun jm/pretty-symbols ()
  "make some word or string show as pretty Unicode symbols"
 (setq prettify-symbols-alist
        '(
          ("lambda" . 955) ; λ
          ("->" . 8594)    ; →
          ("=>" . 8658)    ; ⇒
          ("function" . ?ƒ)
)))
(add-hook 'lisp-mode-hook 'jm/pretty-symbols)
(add-hook 'org-mode-hook 'jm/pretty-symbols)
(add-hook 'js2-mode-hook 'jm/pretty-symbols)
(add-hook 'scala-mode-hook 'jm/pretty-symbols)
#+end_src

#+RESULTS:
| jm/pretty-symbols | (lambda nil (setq prettify-symbols-alist (cons (quote (function . 402)) prettify-symbols-alist)) (prettify-symbols-mode)) | tern-mode | spacemacs/js2-refactor-require | js2-imenu-extras-mode | spacemacs/js-doc-require | flycheck-mode | spacemacs//init-company-js2-mode | company-mode |
*** Capture Templates
#+begin_src emacs-lisp :tangle yes
(setq org-capture-templates
  '(
     ("t" "Todo" entry (file+headline "~/.org/todo.org" "Tasks")
       "* TODO %?\n  %i\n %a")
     ("T" "Todo with clipboard" entry (file+headline "~/.org/todo.org" "Tasks")
       "* TODO %?\n  %i\n %c\n %a")
     ("j" "Journal" entry (file+datetree "~/.org/journal.org")
       "* %?\nEntered on %U\n  %i\n %a")
     ("J" "Journal with Clipboard" entry (file+datetree "~/.org/journal.org")
       "* %?\nEntered on %U\n  %i\n %c\n %a")
     ))
#+end_src
#+RESULTS:
| t | Todo | entry | (file+headline ~/.org/todo.org Tasks) | * TODO %? |
